Revit 2027 API
KeynoteEntry.KeynoteText Property
 The text associated with this KeynoteEntry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string KeynoteText { get; }
Public ReadOnly Property KeynoteText As String
	Get
public:
property String^ KeynoteText {
	String^ get ();
}
member KeynoteText : string with get
Property Value
String
Remarks
 This value does not have to be set; if not set, the property returns an empty string.
See Also
Reference
KeynoteEntry Class
Autodesk.Revit.DB Namespace